/*
 Localized strings for NSErrors returned by AVFoundation.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationErrorDomain_AVErrorUnknown_Description" = "A operação não pode ser concluída";
"AVFoundationErrorDomain_AVErrorUnknown_FailureReason" = "Ocorreu um erro desconhecido (%d)"; /* %d is the underlying error code, most likely in the OSStatus domain */
"AVFoundationErrorDomain_AVErrorOutOfMemory_Description" = "Não Pode Completar Ação";
"AVFoundationErrorDomain_AVErrorOutOfMemory_RecoverySuggestion" = "Tente novamente mais tarde.";

"AVFoundationErrorDomain_AVErrorSessionNotRunning_Description" = "Não Pode Gravar";
"AVFoundationErrorDomain_AVErrorSessionNotRunning_RecoverySuggestion" = "Tente gravar novamente.";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_Description" = "Não Pode Gravar";
"AVFoundationErrorDomain_AVErrorDeviceAlreadyUsedByAnotherSession_RecoverySuggestion" = "Pare todas as ações que estejam usando o %@ e tente novamente."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorNoDataCaptured_Description" = "Não Pode Gravar";
"AVFoundationErrorDomain_AVErrorNoDataCaptured_RecoverySuggestion" = "Tente gravar novamente.";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_Description" = "A Gravação Parou";
"AVFoundationErrorDomain_AVErrorSessionConfigurationChanged_RecoverySuggestion" = "Tente gravar novamente.";
"AVFoundationErrorDomain_AVErrorDiskFull_Description" = "Operação Parada";
"AVFoundationErrorDomain_AVErrorDiskFull_RecoverySuggestion" = "Não há espaço suficiente para continuar a gravação do arquivo. Apague vídeos ou fotos para liberar espaço.";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_Description" = "A Gravação Parou";
"AVFoundationErrorDomain_AVErrorDeviceWasDisconnected_RecoverySuggestion" = "Tente gravar novamente.";
"AVFoundationErrorDomain_AVErrorMediaChanged_Description" = "A Gravação Parou";
"AVFoundationErrorDomain_AVErrorMediaChanged_RecoverySuggestion" = "Tente gravar novamente.";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_Description" = "A Gravação Parou";
"AVFoundationErrorDomain_AVErrorMaximumDurationReached_FailureReason" = "A duração máxima desta gravação foi alcançada."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_Description" = "A Gravação Parou";
"AVFoundationErrorDomain_AVErrorMaximumFileSizeReached_FailureReason" = "O tamanho máximo desta gravação foi alcançado."; /* the file cannot be larger than a certain size on disk */
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_Description" = "A Gravação Parou";
"AVFoundationErrorDomain_AVErrorMediaDiscontinuity_RecoverySuggestion" = "Pare todas as ações que estejam usando o dispositivo de gravação e tente novamente.";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_Description" = "A Gravação Parou";
"AVFoundationErrorDomain_AVErrorMaximumNumberOfSamplesForFileFormatReached_FailureReason" = "A duração máxima desta gravação foi alcançada."; /* the file cannot be longer than a certain duration */
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_Description" = "Não Pode Gravar";
"AVFoundationErrorDomain_AVErrorDeviceNotConnected_RecoverySuggestion" = "Tente gravar novamente.";
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_Description" = "Não Pode Usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceInUseByAnotherApplication_RecoverySuggestion"	= "Pare todas as ações que estejam usando o %@ e tente novamente."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_Description" = "Não Pode Usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceLockedForConfigurationByAnotherProcess_RecoverySuggestion" = "Pare todas as ações que estejam usando o %@ e tente novamente."; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_Description" = "A Gravação Parou";
"AVFoundationErrorDomain_AVErrorSessionWasInterrupted_RecoverySuggestion" = "Pare todas as ações que estejam usando o dispositivo de gravação e tente novamente.";

"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_Description" = "Não Pode Completar Ação";
"AVFoundationErrorDomain_AVErrorMediaServicesWereReset_RecoverySuggestion" = "Tente novamente mais tarde.";

"AVFoundationErrorDomain_AVErrorExportFailed_Description" = "Não Pode Completar Exportação";
"AVFoundationErrorDomain_AVErrorExportFailed_RecoverySuggestion" = "Tente exportar novamente.";
"AVFoundationErrorDomain_AVErrorDecodeFailed_Description" = "Não É Possível Decodificar";
"AVFoundationErrorDomain_AVErrorDecodeFailed_FailureReason" = "Os dados da mídia não puderam ser decodificados. Talvez ela esteja danificada.";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorInvalidSourceMedia_FailureReason" = "Este formato de mídia não é compatível.";

"AVFoundationErrorDomain_AVErrorFileAlreadyExists_Description" = "Não Pode Salvar";
"AVFoundationErrorDomain_AVErrorFileAlreadyExists_RecoverySuggestion" = "Tente salvar novamente.";

"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorCompositionTrackSegmentsNotContiguous_FailureReason" = "Esta mídia não pode ser usada.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentDuration_FailureReason" = "Esta mídia não pode ser usada.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceStartTime_FailureReason" = "Esta mídia não pode ser usada.";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorInvalidCompositionTrackSegmentSourceDuration_FailureReason" = "Esta mídia não pode ser usada.";

"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorFileFormatNotRecognized_FailureReason" = "Este formato de mídia não é compatível.";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorFileFailedToParse_FailureReason" = "Esta mídia talvez esteja danificada.";

"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_Description" = "Não Pode Tirar Foto";
"AVFoundationErrorDomain_AVErrorMaximumStillImageCaptureRequestsExceeded_RecoverySuggestion" = "Tente tirar uma foto novamente.";

"AVFoundationErrorDomain_AVErrorContentIsProtected_Description" = "Operação Parada";
"AVFoundationErrorDomain_AVErrorContentIsProtected_FailureReason" = "A operação não é compatível com conteúdo protegido."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorContentIsNotAuthorized_FailureReason" = "Este conteúdo não está autorizado."; /* the file is DRM protected */
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorApplicationIsNotAuthorized_FailureReason" = "Este aplicativo não está autorizado a reproduzir este arquivo."; /* the file is DRM protected */

"AVFoundationErrorDomain_AVErrorNoImageAtTime_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorNoImageAtTime_FailureReason" = "Esta mídia não pode ser usada.";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_Description" = "Não É Possível Decodificar";
"AVFoundationErrorDomain_AVErrorDecoderNotFound_FailureReason" = "O decodificador necessário para esta mídia não foi encontrado.";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_Description" = "Não É Possível Codificar";
"AVFoundationErrorDomain_AVErrorEncoderNotFound_FailureReason" = "O codificador necessário para esta mídia não foi encontrado.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_Description" = "Não É Possível Decodificar";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_FailureReason" = "O decodificador exigido para esta mídia está ocupado.";
"AVFoundationErrorDomain_AVErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Pare todas as ações que decodifiquem mídia e tente de novo.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_Description" = "Não É Possível Codificar";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_FailureReason" = "O codificador exigido para esta mídia está ocupado.";
"AVFoundationErrorDomain_AVErrorEncoderTemporarilyUnavailable_RecoverySuggestion" = "Pare todas as ações que codifiquem mídia e tente de novo.";
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_Description" = "Não Pode Usar %@"; /* %@ is the device name (for example, "Camera") */
"AVFoundationErrorDomain_AVErrorDeviceIsNotAvailableInBackground_FailureReason" = "O item “%@” não pode ser usado por um aplicativo que está funcionando em segundo plano."; /* %@ is the device name (for example, "Camera") */

"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_Description" = "Operação Parada";
"AVFoundationErrorDomain_AVErrorOperationNotSupportedForAsset_FailureReason" = "A operação não é compatível com este arquivo de mídia.";

"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_Description" = "Operação Parada";
"AVFoundationErrorDomain_AVErrorInvalidVideoComposition_FailureReason" = "O vídeo não pôde ser composto conforme as instruções fornecidas.";

"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_Description" = "Não Pode abrir";
"AVFoundationErrorDomain_AVErrorReferenceForbiddenByReferencePolicy_FailureReason" = "Esta mídia não pode ser usada.";

"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_Description" = "Operação Parada";
"AVFoundationErrorDomain_AVErrorInvalidFileAtDownloadDestinationURL_FailureReason" = "O arquivo de cache do URL de destino do download não pode ser usado.";
